In [ ]:
!pip install pandas

In [2]:
import pandas as pd 
import numpy as  np

In [3]:
## what is datafram 
## how we can create dataframe ,array , list , diction 

dt = {"Name":['Ritu','Taniya','abhishek','tanmay','mayank'],
     "Branch":['it','cse','it','ece','cse'],
     "Class":[2,3,4,1,2], 
     "City":['jaipur','agra','vridavan','mathura','gokul']}
dt

{'Name': ['Ritu', 'Taniya', 'abhishek', 'tanmay', 'mayank'],
 'Branch': ['it', 'cse', 'it', 'ece', 'cse'],
 'Class': [2, 3, 4, 1, 2],
 'City': ['jaipur', 'agra', 'vridavan', 'mathura', 'gokul']}

In [10]:
# np.array()
df = pd.DataFrame(dt)
df

       Name Branch  Class      City
0      Ritu     it      2    jaipur
1    Taniya    cse      3      agra
2  abhishek     it      4  vridavan
3    tanmay    ece      1   mathura
4    mayank    cse      2     gokul

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
## series 
df['Name']

0        Ritu
1      Taniya
2    abhishek
3      tanmay
4      mayank
Name: Name, dtype: object

In [13]:
type(df['Name'])

pandas.core.series.Series

In [17]:
# df

In [15]:
df.dtypes 
## categorical

Name      object
Branch    object
Class      int64
City      object
dtype: object

In [19]:
df.shape 
# 5 ==> rows  
# 4 ==> columns

(5, 4)

In [25]:
df.Name       # df['Name']

0        Ritu
1      Taniya
2    abhishek
3      tanmay
4      mayank
Name: Name, dtype: object

In [29]:
df[['City','Name','Branch']]

       City      Name Branch
0    jaipur      Ritu     it
1      agra    Taniya    cse
2  vridavan  abhishek     it
3   mathura    tanmay    ece
4     gokul    mayank    cse

In [32]:
df[1:2]

     Name Branch  Class  City
1  Taniya    cse      3  agra

In [36]:
df[['Name','Branch']][1:3][0:2]

       Name Branch
1    Taniya    cse
2  abhishek     it

In [38]:
# df[1:3,0:2]

In [40]:
#loc & iloc
#loc == stoping point inclusive 
df.loc[1:2,['Name','Branch']]

       Name Branch
1    Taniya    cse
2  abhishek     it

In [41]:
df

       Name Branch  Class      City
0      Ritu     it      2    jaipur
1    Taniya    cse      3      agra
2  abhishek     it      4  vridavan
3    tanmay    ece      1   mathura
4    mayank    cse      2     gokul

In [42]:
df.iloc[1:3,0:2]

       Name Branch
1    Taniya    cse
2  abhishek     it